[
	{
		"article_id": "811abab6bad499e8c3c059877f3d3fdc",
		"title": "Kanye West listing gutted beachfront Malibu home for $53 million",
		"link": "https://ktla.com/entertainment/kanye-west-listing-gutted-beachfront-malibu-home-for-53-million/",
		"keywords": ["Entertainment", "Local News", "News"],
		"creator": ["Josh DuBose"],
		"video_url": null,
		"description": "Ye, aka Kanye West, is taking a hefty financial hit in listing a beachfront Malibu home he purchased in 2021 for $57.3 million, according to multiple reports. The 4,000 square foot, four-bedroom property was designed by famed Japanese architect Tadao Ando. While there aren’t a lot of Ando-designed homes in the United States, his [...]",
		"content": "by: Josh DuBose Posted: Dec 19, 2023 / 08:59 PM PST Updated: Dec 19, 2023 / 08:59 PM PST Ye, aka Kanye West, is taking a hefty financial hit in listing a beachfront Malibu home he purchased in 2021 for $57.3 million, according to multiple reports. The 4,000 square foot, four-bedroom property was designed by famed Japanese architect Tadao Ando. While there aren’t a lot of Ando-designed homes in the United States, his name might ring a bell. The Japanese architect designed a house in the Paradise Cove area of Malibu, aptly nicknamed Billionaires’ Row, that was purchased by Beyoncé and husband Jay-Z for $200 million earlier this year. That sale was billed as the most expensive home ever sold in California. But back to Ye’s Malibu home, which he has decided to sell for $53 million after having the property gutted for a remodel. “What’s missing are the interiors,” celebrity real-estate agent Jason Oppenheim told The Hollywood Reporter . The Selling Sunset real-estate broker is listing West’s house exclusively. He told the entertainment outlet that while Ando’s signature concrete work is still fully intact, potential buyers will need to spend a couple of million dollars to bring it “up to 2024 standards.” In addition to not having any interiors, Yeezy is reportedly being sued by a man who claims he was hired by the rapper in September 2021 to be the remodel project manager, 24-hour security and caretaker of the property, TMZ reported . That said, the sleekly modern concrete and steel beachfront home, which boasts some 1,500 square feet in outdoor decks, as well as oceans views from every room, will likely have little problem attracting interested parties with deep pockets. Submit Δ Copyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.",
		"pubDate": "2023-12-20 04:59:28",
		"image_url": "https://ktla.com/wp-content/uploads/sites/4/2022/12/b2da71ae010a4b09ac498ccb207c9d05.jpg?w=900",
		"source_id": "ktla",
		"source_priority": 2036,
		"country": ["united states of america"],
		"category": ["top"],
		"language": "english"
	},
	{
		"article_id": "76d5c38fa080dd51613d6b989d83e855",
		"title": "Take Profit: 3 Stocks to Sell That Are Up More Than 100% in 2023",
		"link": "https://investorplace.com/2023/12/take-profit-3-stocks-to-sell-that-are-up-more-than-100-in-2023/",
		"keywords": [
			"Stocks to Sell",
			"NASDAQ:DASH",
			"NASDAQ:PANW",
			"NASDAQ:OPEN",
			"Stocks to Sell"
		],
		"creator": ["Michael Que"],
		"video_url": null,
		"description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Maximize your profits and minimize your risks by cleaning your portfolio of these overvalued stocks. Let's look at the stocks to sell now. The post Take Profit: 3 Stocks to Sell That Are Up More Than 100% in 2023 appeared first on InvestorPlace. More From InvestorPlace The #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors",
		"content": "The future of the U.S. economy appears to be optimistic. The Federal Reserve has signaled a potential shift towards interest rate cuts in the coming year, providing relief to American households grappling with high inflation. Additionally, the Biden administration’s hope for a “soft landing,” characterized by decreasing inflation without a significant increase in unemployment or a recession, seems validated by the Fed’s more dovish posture. The prospect of lower interest rates is anticipated to benefit various sectors, specifically investments. In fact, this shift could potentially influence economic perceptions in the lead-up to the 2024 presidential election. If our economy is projecting to avoid a recession and the market is expecting to perform well, now is the time to get out of risky and overvalued positions. If you’re itching to consider safer investments instead, begin by selling these stocks now to maximize profits and minimize risk. DoorDash (DASH) DoorDash (NASDAQ: DASH ) is a food delivery service that works with local restaurants to deliver food to people’s homes and businesses. Despite facing challenges, the company has achieved substantial revenue, totaling $8.15 billion in the trailing twelve months with a gross profit of $3.08 billion. Impressively, in 2023, DASH demonstrated a robust 112.39% year-to-date stock price, indicating a strong market presence and demand for its services. But, we need to look into the details: DASH’s P/E non-GAAP (FWD) sits at 57.56, which is 270% above the competition. Regretfully, this signals that DASH has massive overvaluation. DoorDash faces potential challenges in its long-term sustainability as a company. While demand for its services has surged, the risk of a prolonged shortage of drivers or labor-related issues looms large. The low net pay for “Dashers,” exacerbated by rising vehicle costs and maintenance expenses, may lead to a high turnover of drivers. This is particularly likely if economic dynamics shift or if alternative employment options become more appealing. The hypothetical result poses a significant threat to the company’s workforce stability and overall success. This overvaluation and weakening workforce mean that its business model is unsustainable, riding on Covid-19 highs. Palo Alto Networks (PANW) Palo Alto Networks (NASDAQ: PANW ) has enjoyed significant success this year, with a remarkable 122.16% year-to-date increase. As of writing this article, the company anticipates an additional 18.76% growth in 2024. To be fair, this isn’t an unprecedented goal. In 2023, its revenue experienced a robust growth of 25.3%, reaching $6.89 billion. Notably, Palo Alto Networks achieved a $439 million profit in FY 2023, a notable turnaround from the $267 million loss in FY 2022. Undoubtedly, it has been a standout performer in the tech sector throughout the year justifying its robust performance. However, the impressive market performance has led to a substantial overvaluation. Right now, the company’s stock sits with a P/E GAAP (TTM) of 172.82%, surpassing competitors by 523.9%. This P/E should raise some alarms, concerns arise due to a slowdown in the company’s growth. The surge in orders during the past couple of years is now tapering off as competitors get more aggressive. Moreover, Palo Alto Networks itself acknowledges an expected downtrend of sales. Particularly worrisome is the projected shrinkage of billings, a key metric representing new orders and a reliable predictor of future revenue. Now is the time to get rid of your PANW holdings, before we see the valuation take any hits and while you can maximize profits. Opendoor Technologies (OPEN) Opendoor Technologies (NASDAQ: OPEN ) is a leader in the digital real estate space that aims to help customers get real-time quotes for buying and selling homes. Currently valued at $4.56 , OPEN has had an impressive year with exactly 200% year-over-year growth. However, profits may be slow while stock growth is at its apex. From an industry standpoint, OPEN is placed in the profitable, well-established real estate sector. In 2021, real estate brought in $3.69 trillion, with projections for that number to grow up to $5.85 trillion by 2030 with a 5.2% CAGR . Financially, OPEN reported a mediocre Q3 2023 with metrics down in revenue and net change in cash. Specifically, the company brought in revenue of $980 million, marking a significant 70.84% decrease year-over-year, as well as another large loss compared to $1.9 trillion brought in the previous quarter ( Q2 2023 ). Further, revenue failed to meet consensus by 3.39%. Net income was reported at -$106 million per quarter , with net change also being reported at -$426 million , though they were year-over-year increases. Overall, these poor financials suggest that OPEN will have a down year in terms of expansion. They have no net change in cash along with a significant loss through net income. For a predominantly virtual company, large debts and loss in income have OPEN projected for marginal output this year, compared to the large successes seen in prior years. Don’t risk the current profit at stake with OPEN, and sell the stock while the valuation is high. On the date of publication, Michael Que did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines . The researchers contributing to this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article.",
		"pubDate": "2023-12-20 04:54:28",
		"image_url": null,
		"source_id": "investorplace",
		"source_priority": 3707,
		"country": ["united states of america"],
		"category": ["top"],
		"language": "english"
	},
	{
		"article_id": "95ef431aae74b0f37e99879982c8c97e",
		"title": "Tenants concerned about possible sale of Fayetteville apartment complex",
		"link": "https://www.nwahomepage.com/news/tenants-concerned-about-possible-sale-of-fayetteville-apartment-complex/",
		"keywords": [
			"Featured Stories",
			"KNWA",
			"News",
			"Northwest Arkansas News",
			"Arkansas",
			"Knwa",
			"Landlord",
			"Property",
			"Renters",
			"Rights"
		],
		"creator": ["Christina Randall"],
		"video_url": null,
		"description": "The land Beverly Manor Apartments in Fayetteville sits on is up for sale, and the tenants say they found out about it after seeing a listing on Zillow.",
		"content": "FAYETTEVILLE, Ark. (KFTA/KNW ) — The land Beverly Manor Apartments in Fayetteville sits on is up for sale, and the tenants say they found out about it after seeing a listing on Zillow. According to Fayetteville attorney Tim Snively, landlords aren’t required to tell tenants they are selling the apartment or even selling the land the apartment is on. People who currently live at Beverly Manor Apartments don’t know if they’ll be allowed to stay once the property sells. “Situations do occur where you are renting a property and the ownership of that changes, and now the new owner comes in and wants to evict you. And they can do that because they don’t have to follow the obligations of the prior lease agreement,” said Snively. The situation tenants of Beverly Manor Apartments are facing raises the question, “What rights do renters have in Arkansas?” According to Snively, if a property is sold and the new landlord wants to have the renters out of the property, renters are given 30 days to move out before the new landlord can start the eviction process. “I would find it very rare for someone who is renting a property in the middle of their rental agreement that the property would sell,” said Snively. “But with the current real estate market in Northwest Arkansas, those things are occurring occasionally.” With Northwest Arkansas attracting people from different states to move here, Snively says it’s important to read up on renter and landlord rights. “Each state has different laws as to landlord-tenant eviction process,” said Snively. “So, many times the people who moved here are familiar with the laws of the state they came from and not the laws of the state of Arkansas.” Snively also has recommendations for landlords. He says to put in the lease what would happen to your renters if you do decide to sell the property. “It might be a good idea to make sure in the lease there is language that contemplates the issue of the landlord selling the property and set forth what your obligations and their obligations would be if that would happen,” said Snively. While the land hasn’t sold yet, Snively says it is rare to see a new owner evict tenants from their apartments. He says new owners will normally wait until the end of the current lease. The listing on Zillow is specifically targeted towards student housing developers.",
		"pubDate": "2023-12-20 04:33:57",
		"image_url": "https://www.nwahomepage.com/wp-content/uploads/sites/90/2023/12/apartments.png?w=900",
		"source_id": "nwahomepage",
		"source_priority": 21820,
		"country": ["united states of america"],
		"category": ["top"],
		"language": "english"
	},
	{
		"article_id": "0e44866426f9d3cb8cc6acbb0608ed1f",
		"title": "3 Monthly Dividend Stocks for Steady Income in 2024",
		"link": "https://investorplace.com/2023/12/3-monthly-dividend-stocks-for-steady-income-in-2024/",
		"keywords": [
			"Stocks to Buy",
			"NYSE:O",
			"NASDAQ:AGNC",
			"NYSE:MAIN",
			"OTCMKTS:FNMA",
			"OTCMKTS:FMCC",
			"OCTMKTS:SVNDY",
			"NASDAQ:WBA",
			"Stocks to Buy"
		],
		"creator": ["Vandita Jadeja"],
		"video_url": null,
		"description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Watch your investments grow by enjoying monthly returns through these three monthly dividend stocks in the new year. The post 3 Monthly Dividend Stocks for Steady Income in 2024 appeared first on InvestorPlace. More From InvestorPlace ChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors",
		"content": "Compared to this past year, 2024 is expected to be much better for the economy, and that means it will look even better for the stock market. As we approach the new year, it is time to take a good look at your portfolio and look for stocks that fit your goals. If you are someone who enjoys passive income like me, there are a few monthly dividend stocks to consider. They will ensure a steady flow of income throughout 2024 while you enjoy capital appreciation. With that in mind, let’s take a look at the three monthly dividend stocks to buy for steady income in 2024. Realty Income (O) One of the best monthly dividend stocks for income is Realty Income (NYSE: O ), which even calls itself “The Monthly Dividend Company.” It is a real estate investment trust ( REIT ) — and a leader in the sector having paid dividends for over 600 months in a row. The company manages to generate income through the portfolio of properties it owns across different states, and it has some of the most well-known companies on their list. With tenants like Walgreens (NASDAQ: WBA ) and 7-Eleven (OTCMKTS: SVNDY ), the company ensures a predictable and steady flow of income each year. O stock is exchanging hands for $56.51, having dropped 11% year to date. It enjoys a dividend yield of 5.37% and is a Dividend Aristocrat. Since the company focuses on commercial properties that serve basic needs like convenience stores, it will not run out of business. While the dividend yields may go up and down, the stock will continue to pay each month. To that end, you must remember that your dividend is safe. In the third quarter, the company saw a significant improvement in its International business and it made acquisitions worth $2 billion. This shows its potential to keep thriving even in an uncertain market. O stock is an attractive choice for investors, and if the Federal Reserve decides to lower the rates, we could see the stock perform much better. Despite the recent drop in the stock, it remains one of the best dividend stocks to own. AGNC Investment (AGNC) Another REIT, AGNC Investment (NASDAQ: AGNC ) buys and sells residential mortgage-backed securities. Additionally, it’s a highly stable REIT since it engages in securities that are guaranteed by organizations and agencies like Freddie Mac (OTCMKTS: FMCC ) and Fannie Mae (OTCMKTS: FNMA ). It invests in high-yield long-term assets and borrows at a low, short-term rate. Since the majority of its investments are in mortgage-backed securities, they have the faith and credit of the government. Thus, it’s a low-risk investment and the company can continue expanding its portfolio to make higher profits without worrying about a default on these loans. Trading at $9.73 today, this stock has a dividend yield of 14.80% — which is nothing but impressive. You earn about $0.12 per month per share, which totals $1.44 annually. Looking at the share price, this isn’t a bad deal at all. In the third quarter results , the company reported a net loss of $0.68 and an investment portfolio of $59.3 billion. The current high-interest environment is a huge problem for the company. However, as the situation improves, AGNC Investment could see a strong improvement in its financials. I believe the stock will hit $10 very soon and while you wait for it to move upwards, you can earn passive income each month. It was trading as high as $18 in 2021 but has dropped since then. Buy the stock for a steady income. Main Street Capital (MAIN) Rounding out this list, Main Street Capital (NYSE: MAIN ), a private equity firm, has a dividend yield of 6.66%. The company offers financing to small and medium-sized companies which are unable to get funding from traditional lenders. The company enjoys an impressive yield for the shareholders and it has increased the dividend for the past 12 years. Lately, shareholders have been paid a monthly dividend of $0.24 which is not bad considering MAIN stock is exchanging hands for $43. It is up 17% year to date. As the economy improves, we could see it move higher. One big reason to invest in the stock is its diversified portfolio. It spans over 50 industries, 195 companies and has a wide range of private loans, middle market, and the lower middle market portfolios. With businesses growing across the country, the demand for funds will continue to grow, and Main Street Capital will play a significant role here. The company has enough earnings to cover the dividends which also proves that the payment is sustainable. Besides enjoying a high yield, you will also enjoy capital appreciation since the stock has increased 20% in value in the year. This is one stock to buy and hold for the long term. On the date of publication, Vandita Jadeja did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines .",
		"pubDate": "2023-12-20 04:33:38",
		"image_url": null,
		"source_id": "investorplace",
		"source_priority": 3707,
		"country": ["united states of america"],
		"category": ["business"],
		"language": "english"
	},
	{
		"article_id": "7eab5a3e389fcc40c89e55a4a52b46b0",
		"title": "Bill awaiting Gov. Kathy Hochul's signature would make it easier to find out who owns a building in New York State",
		"link": "https://www.cbsnews.com/newyork/news/llc-transparency-act-building-owners-new-york-state/",
		"keywords": [
			"Local News",
			"Syndicated Local",
			"Syndicated CBSNNY",
			"New York News"
		],
		"creator": ["Tim McNicholas"],
		"video_url": null,
		"description": "The bill would create a public database which would list the names of those who benefit from an LLC.",
		"content": "NEW YORK -- Why is it so difficult to find out who owns a building in New York State? Many companies are registered to LLCs and shell companies, but a bill awaiting Gov. Kathy Hochul signature would change that. CBS New York investigative reporter Tim McNicholas looked into what the new law could mean for New Yorkers and how it ties into last week's partial building collapse in the Bronx . Before Emily Gallagher started representing Greenpoint, Brooklyn, in the New York State Assembly, she was a neighborhood activist advocating for tenants' rights. One of those rights is knowing exactly who owns your building. \"With the Bronx building collapse, this is absolutely frustrated me and broke my heart because this is exactly what this bill is targeting,\" Gallagher said. Records for that Bronx building from the city's housing preservation department listed one name as the head officer of the LLC that owns the building. Department of Buildings records from the last few years listed two other names as owners. When we tracked down someone who said he was building's landlord , he gave yet another name. \"Right now, there's no way to know who owns an LLC. So if there's any issues with that business, it's very difficult to hold that actually business accountable,\" Gallagher said. That is why Gallagher introduced the LLC Transparency Act. It passed with bipartisan support. If the governor signs the bill, it would create a public database which would list the names of those who benefit from the company; it would be the first in the nation. \"There are other countries that have cities that already use this. For example, London in England has already done this step, and it's really helped people understand the relationships between, for example, the press, buildings, corporations,\" Gallagher said. But some landlords and business owners say the bill puts a target on the backs of those just trying to make a living. The Real Estate Board of New York sent CBS New York a statement, saying in part, \"A publicly available database would create privacy and identity theft risks for New Yorkers and risks weakening New York's economy.\" Chelsea Lemon with the New York Business Council agrees. \"A public database could jeopardize, you know, people's information, have it out there. It could used for blackmail or extortion, or worse yet, it could be used by a foreign government,\" she said. The bill partially mirrors the Federal Corporate Transparency Act, which aims to stop people from using shell companies to launder money and avoid economic sanctions. \"The primary part of this bill is to go after illegal activities, which we support. I think transparency is important. However, the public database is really jeopardizing the safety of our small business owners,\" Lemon said. \"The reason why we really want that public database is because it will allow people who have bad-acting LLCs in their lives to be able to take that step themselves. We have put in guards for privacy. We've put in an anonymity opportunity for folks, and this is something that does work,\" Gallagher said. Hochul has until Sunday to sign or veto the bill. We sent the governor's office several questions about this bill, but they would only tell us she's reviewing it Tim McNicholas is a reporter for CBS New York. He joined the team in September 2022 after working in Chicago, Indianapolis, Toledo and Hastings, Nebraska.",
		"pubDate": "2023-12-20 04:00:12",
		"image_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2019/09/09/b686bf4c-c1b0-43da-85f9-f639e49e53a6/thumbnail/1024x576/7286c1a36eb37c586293e228fd606aaf/nyc-apartment-building.jpg?v=5382e209c94ee904b3a96a69f8ca0ce0",
		"source_id": "newyorkcbslocal",
		"source_priority": 237564,
		"country": ["united states of america"],
		"category": ["top"],
		"language": "english"
	},
	{
		"article_id": "424859fce2302c95fd3dd278d49b8689",
		"title": "Finback Brewery to Return to Queens Roots With Third Outpost",
		"link": "https://whatnowny.com/finback-brewery-to-return-to-queens-roots-with-third-outpost/",
		"keywords": [
			"restaurants",
			"Basil Lee",
			"Brooklyn",
			"Catskills",
			"Finback Brewery",
			"Finger Lakes",
			"Glendale",
			"Gowanus",
			"Kevin Stafford",
			"Long Island City",
			"Manhattan",
			"Queens",
			"Rhode Island"
		],
		"creator": ["Falyn Stempler"],
		"video_url": null,
		"description": "The local brewery debuted in Glendale about a decade ago. Now, the team is opening their third taproom in Long Island City.",
		"content": "After nearly a decade since its debut in Glendale, Finback Brewery will be launching its second Queens taproom this month. This will be the New York City-based brewery’s third outpost. The newest location will be a 3,800-square-foot space at Queens Plaza in Long Island City, where the team will focus on serving “fruit-forward fermentation” using local produce – primarily from New York’s Finger Lakes, Hudson Valley and Long Island regions – to make beer with apples, peaches, blueberries, cherries and grapes, its co-owner Basil Lee told . The new space will also offer natural wines and ciders. “We’ll definitely have IPAs and lagers and all that [in Long Island City], but if you want to come in and try something a little different, I think we’ll have a unique fermentation portfolio here as well,” Lee tells about its newest taproom. The team has been stewarding a farm in the Western Catskills in Upstate New York, where it is experimenting with growing small batches of fruit. In the future, the team hopes to make its fruit-fermented beers with their own produce, as well as add a taproom in the area. It also hopes to expand into Manhattan and the greater New England area. The team debuted its first taproom in Glendale, which has a “neighborly, factory-vibe,” according to Lee, about a decade ago, where the team built its “local and regional” brand on “hazy IPAs and barrel-aged stouts.” However, when the team opened their second outpost in Gowanus, Brooklyn, closer to Lee and his partner Kevin Stafford’s home, the team began to expand its foods offering, including its Asian-cuisine street food program, Dumpling Up, which was helmed by Lee’s mother who formerly ran her family’s Chinese restaurant in Rhode Island before selling it less than a decade ago. Lee said the Long Island City location will offer a similar “small menu” but it will be expand its dumpling program, adding wonton noodles and other Asian-centric fare. “I think, in some ways, it’s true [Asian food] is not the first thing you think about –it’s like wings, pizza, burger with beer,” Lee admits, however, he says that “Asian food, generally, pairs very well with beer.” “For me, spicy foods and Asian street foods and snacks work well with a nice craft beer, so I wanted to do it; but, in some ways, it was more of just a personal history,” he says about the dumpling program. “I grew up in the restaurant business and it’s food that I grew up with and always loved.” Related Posts © What Now Media Group 2023. All rights reserved.",
		"pubDate": "2023-12-20 03:14:26",
		"image_url": "https://whatnowny.com/wp-content/uploads/sites/11/2023/12/Finback.jpg-2-200x300.jpg",
		"source_id": "whatnowny",
		"source_priority": 288855,
		"country": ["united states of america"],
		"category": ["top"],
		"language": "english"
	},
	{
		"article_id": "8332747f1e7fe9d9e9288cd779f75145",
		"title": "Myeong-dong cements status as Korea’s super-prime area",
		"link": "https://www.kedglobal.com/real-estate/newsView/ked202312200003",
		"keywords": ["Culture & Trends"],
		"creator": ["skseo@hankyung.com (서수경)"],
		"video_url": null,
		"description": "A 170-square-meter land in Myeong-dong, central Seoul, where South Korean beauty brand Nature Republic’s flagship store is located, has retained the title of the country’s most expensive real estate property for 21 years in a row, data showed on Wednesday. The prime plot in the middle of the bustling shopping district popular among foreign tourists is appraised at 175.4 million won ($135,000) per square meter, up 0.7% from a year ago, according to data released by the Ministry of Land, Infrastructure and Transport. It has remained at the top of the nation’s real estate price list since 2004. The plot’s price bounced back this year after losing its value in the previous two years during the COVID-19 pandemic, which took a big hit to the popular tourist destination. The second most expensive plot is also located in Myeong-dong. The 390.4-square-meter land, occupied by major local commercial bank Woori Bank outlet, is priced at 174 million won per square meter, up 0.8% on-year. The shopping district in central Seoul also owns the third and fourth highest-priced properties in the country – 165.3 million won and 157.7 million won, each, – tenanted by a clothing store and a local beauty brand’s outlet. Affluent Gangnam-gu and Seocho-gu also have the ninth and tenth most expensive commercial plots that saw single-digit percentage gains on-year. The average land price in Myeong-dong is on the recovery course thanks to the return of tourists to Korea after the end of the pandemic, reviving the fame of the area as Seoul's busy shopping and foodie district. MOST EXPENSIVE HOUSE IN KOREAThe data also showed that the most expensive residential building is a house owned by Lee Myung-hee, the chairperson of Korean retail conglomerate Shinsegae Group. The house, with a gross area of 2,861.83 square meters, boasts a hefty price tag of 28.57 billion won, up 1.9% from a year ago, and it has remained the most expensive so-called sample standard house since 2016. It is located in Seoul’s central area of Yongsan-gu, where the country’s other top-tier business leaders own pricy houses, including the country’s third and fourth most expensive homes owned by Samsung Group and Suh Kyung-bae, the chair of the country’s biggest cosmetics and skincare maker Amorepacific, respectively. Every year, the Korean land ministry selects and reviews prices of some sample standard houses and plots deemed as the most representative to use them as references in setting relevant taxes. By So-Hyeon Kimalpha@hankyung.comSookyung Seo edited this article.",
		"content": "A 170-square-meter land in Myeong-dong, central Seoul, where South Korean beauty brand Nature Republic’s flagship store is located, has retained the title of the country’s most expensive real estate property for 21 years in a row, data showed on Wednesday. The prime plot in the middle of the bustling shopping district popular among foreign tourists is appraised at 175.4 million won ($135,000) per square meter, up 0.7% from a year ago, according to data released by the Ministry of Land, Infrastructure and Transport. It has remained at the top of the nation’s real estate price list since 2004. The plot’s price bounced back this year after losing its value in the previous two years during the COVID-19 pandemic, which took a big hit to the popular tourist destination. The second most expensive plot is also located in Myeong-dong. The 390.4-square-meter land, occupied by major local commercial bank Woori Bank outlet, is priced at 174 million won per square meter, up 0.8% on-year. The shopping district in central Seoul also owns the third and fourth highest-priced properties in the country – 165.3 million won and 157.7 million won, each, – tenanted by a clothing store and a local beauty brand’s outlet. Affluent Gangnam-gu and Seocho-gu also have the ninth and tenth most expensive commercial plots that saw single-digit percentage gains on-year. The average land price in Myeong-dong is on the recovery course thanks to , reviving the fame of the area as Seoul's busy shopping and foodie district. The data also showed that the most expensive residential building is a house owned by Lee Myung-hee, the chairperson of Korean retail conglomerate Shinsegae Group. The house, with a gross area of 2,861.83 square meters, boasts a hefty price tag of 28.57 billion won, up 1.9% from a year ago, and it has remained the most expensive so-called sample standard house since 2016. It is located in Seoul’s central area of Yongsan-gu, where the country’s other top-tier business leaders own pricy houses, including the country’s third and fourth most expensive homes owned by Samsung Group and Suh Kyung-bae, the chair of the country’s biggest cosmetics and skincare maker Amorepacific, respectively. Every year, the Korean land ministry selects and reviews prices of some sample standard houses and plots deemed as the most representative to use them as references in setting relevant taxes. So-Hyeon Kim at",
		"pubDate": "2023-12-20 02:33:26",
		"image_url": "https://www.kedglobal.com/data/ked/image/2023/12/20/ked202312200007.700x.0.jpg",
		"source_id": "kedglobal",
		"source_priority": 218240,
		"country": ["united states of america"],
		"category": ["top"],
		"language": "english"
	},
	{
		"article_id": "6ea5af5bf9fa2eb0b0ba726616877033",
		"title": "How to Buy Your First Duplex: ‘House Hacking’ for Beginners",
		"link": "https://www.postguam.com/news/national/how-to-buy-your-first-duplex-house-hacking-for-beginners/article_905ff7ee-a5e4-59af-9fd6-2e9f537493a8.html",
		"keywords": null,
		"creator": ["Abby Badach Doyle"],
		"video_url": null,
		"description": "Emily Johnson recalls her first duplex fondly — well, sort of.She rented to a friend’s sister, who ended up being “a nightmare”: The tenant smoked in the house, paid rent late and knocked on Johnson’s door at 11 p.m. with…",
		"content": "Emily Johnson recalls her first duplex fondly — well, sort of. She rented to a friend’s sister, who ended up being “a nightmare”: The tenant smoked in the house, paid rent late and knocked on Johnson’s door at 11 p.m. with maintenance requests. Nevertheless, Johnson caught the investing bug. That experience 20 years ago inspired her to buy four more owner-occupied, or live-in, duplexes, which generally require smaller down payments than investment properties occupied by tenants alone. Today, she works as a real estate agent with Sotheby’s in Los Angeles, helping others buy multifamily properties — and avoid common beginner blunders. “I made all the mistakes the first time,” Johnson says with a laugh. On TikTok, influencers have rebranded this concept as “house hacking.” Buying an owner-occupied multifamily property has a fresh appeal to younger buyers thirsty for passive income, or just a leg up in a brutal housing market. The typical monthly principal and interest payment on a has more than doubled in the past three years, from $1,035 in 2020 to $2,192 in Q3 2023, according to the National Association of Realtors. Suddenly, unclogging someone else’s toilet doesn’t seem so bad, so long as they’re helping pay your mortgage. But that rental income is “not free money,” Johnson stresses. To succeed as a live-in landlord, you need a goal, a budget and good boundaries, as well as a solid rental agreement to protect everyone involved. For many, buying an owner-occupied multifamily is the beginning of a path to financial freedom. “It's literally someone else paying your mortgage,” Johnson says. First, establish your homebuying budget. Then, estimate how much the market rate rent will offset your mortgage payment — and establish your plan for the added income. Do you want to on a single-family home, then sell the duplex when you’re ready to move? Or maybe you’ll keep it to fund your child’s education — or your next multifamily property. In Los Angeles, Johnson sees entertainment industry workers buying multifamily properties to have a source of steady cash between gigs. “It's a great model for artists, for people who want extra passive income,” she says. Find a buyer’s agent who understands your goals and can help find a suitable property. For example, you might be willing to sacrifice on square footage if you plan to move out in a few years. For a long-term residence, you might want more space and privacy. You’ll save money if you shop around: Compare lenders (at least three) for your You don’t need to put 20% down to buy a multifamily property. Last month, Fannie Mae lowered its down payment requirements to 5% for multifamily properties up to four units, which previously required 15% to 25% down. You can put down as little as 3.5% on a property up to four units with an FHA loan. Matt Horan bought his first home, a duplex, in Pittsburgh in August 2019 using an . That enabled him to roll remodeling costs into his monthly mortgage payment. “I thought, OK, I would be able to buy a home now sooner than I anticipated for a less upfront cost,” he says, “while I have someone that pays for most of my mortgage, if not all.” One common misstep for new live-in landlords is underestimating costs, says Bob Pinnegar, president and CEO of the National Apartment Association. When pricing out renovations or repairs, multiply the need by the number of units. If one water heater needs to be replaced, they might all need it, Pinnegar says. Routine maintenance is another expense, but you can save if you’re willing to do some work yourself. You’re also on the hook to pay insurance and taxes, which are likely to increase over time. “You're running a business now,” Pinnegar says. “You have to set up a budget.” When thinking through costs, prioritize which upgrades could help you earn more rental income. That might mean redoing your tenants’ units before your own. Johnson recalls her first duplex. “Our side was a disaster for the longest time because we're like, ‘We can live with that,’” she says. “We needed to get that income coming in — and the income paid for our renovation.” Horan knew he needed to invest in cosmetic fixes, like ripping out the shag carpeting, to make his duplex appeal to tenants. Horan also hired a contractor to convert each unit’s dining room into a second bedroom to increase the market rate rent. If you find a lease template online, make sure it’s reviewed by a real estate attorney who is familiar with your area’s regulations, Pinnegar says. The lease must follow local, state and federal laws to prevent discrimination, including rules about tenant rights and rent control. Fair housing laws apply when advertising your property and reviewing potential tenants, too. For example, you can say it’s a nonsmoking building, but you can’t say “Smokers need not apply.” To ensure you’re following fair housing laws, your local Apartment Association can recommend companies to assist with background checks and tenant screening. Use the same criteria when reviewing all potential tenants. Ideally, their gross income should be at least two and a half to three times what you’re charging for rent, Pinnegar says. Finally, familiarize yourself with health and safety codes that set standards for rental properties. A home inspection can catch hazards like lead paint or mold. In your lease, let tenants know how you’ll address common concerns like parking, noise complaints and maintenance requests. “That way you’re able to really put together an agreement that's going to govern the relationship in good times and bad,” Pinnegar says. Clear expectations are key for everyone’s safety and comfort — especially as a live-in landlord, when you might be sharing walls or common areas. It might seem like a good idea to rent to friends or family members, but blurring the line between personal and professional relationships can create conflict. “Have good boundaries — I just can't stress that enough,” Johnson says. It’s not always easy to manage a duplex or other multifamily property, but the experience can help you grow personally and professionally. Horan says it’s been rewarding to make connections, learn maintenance skills and help his tenants when they need him. “You're going to continue to learn things about yourself, about the business,” he says. “It's important just to have that open mind and learn.” The article How to Buy Your First Duplex: ‘House Hacking’ for Beginners originally appeared on NerdWallet.",
		"pubDate": "2023-12-20 01:39:35",
		"image_url": "https://bloximages.newyork1.vip.townnews.com/postguam.com/content/tncms/assets/v3/editorial/0/53/0533bde8-3d5d-5360-9060-67ff9d0286fd/65822082a39a6.image.jpg?resize=300%2C200",
		"source_id": "postguam",
		"source_priority": 93374,
		"country": ["united states of america"],
		"category": ["top"],
		"language": "english"
	},
	{
		"article_id": "da0f9627acb6dfdd63eff1bb1724ebae",
		"title": "Jury ends Day 1 of deliberations in ex-Ald. Ed Burke corruption case without a verdict",
		"link": "https://news.knowledia.com/US/en/articles/jury-ends-day-1-of-deliberations-in-ex-ald-ed-burke-corruption-case-8e3c672c0412a38e44212b5fb06c5aeb6c8df4ee?source=rss",
		"keywords": null,
		"creator": null,
		"video_url": null,
		"description": "After five weeks of testimony, early 40 witnesses, more than 100 secret recordings, two COVID-related delays and about 16 hours of closing arguments, the jury in the corruption trial of former Chicago Ald. Ed Burke began deliberations - www.chicagotribune.com",
		"content": "Former Ald. Edward Burke arrives at the Dirksen U.S. Courthouse for his corruption trial on Dec. 12, 2023. (Antonio Perez/Chicago Tribune) The jury in the historic corruption case of former Chicago Ald. Ed Burke has begun deliberating after five weeks of testimony that included nearly 40 witnesses, more than 100 secret recordings, two COVID-related delays and about 16 hours of closing arguments. The jury of nine women and three men sat through about four hours of jury instructions before beings sent back at about 2:15 p.m. to begin their discussions. Advertisement \"Now you can talk about the case!\" U.S. District Judge Virginia Kendall said to the panel as they filed out Monday. Jurors were sent home for the evening at 5 p.m., without having sent any notes or questions to the judge. They are expected to resume deliberating at 9 a.m. Tuesday. Advertisement The instructions read aloud by Kendall ran some 350 pages. That's longer than the 310 pages of Burke's 1996 book \"Inside the Wigwam,\" a history of national political conventions held in Chicago, which was referenced several times during the trial. The jury's first job will be to elect a foreperson. They'll then go about sorting through the 19 counts in the case, which include 14 counts against Burke and a combination of other charges involving his two co-defendants, longtime ward aide Peter Andrews Jr. and real estate developer Charles Cui. Though tedious, the legal instructions will be crucial in determining how the panel reaches its verdict, including making findings on everything from what constitutes official misconduct to whether Burke and his co-defendants acted \"knowingly\" when committing certain acts. After three days of closing arguments wrapped last week, Kendall sent the jury home for the… Jason Meisner , Ray Long , Megan Crepeau",
		"pubDate": "2023-12-20 01:21:46",
		"image_url": "https://www.chicagotribune.com/resizer/Aah84e4TKrLuCUK3Nbs61HqFIZ0=/2503x1862/cloudfront-us-east-1.images.arcpublishing.com/tronc/ND7Z2VCZCZHGFCGWEXQWS7H4HU.JPG",
		"source_id": "knowledia",
		"source_priority": 167779,
		"country": ["united states of america"],
		"category": ["top"],
		"language": "english"
	},
	{
		"article_id": "94238394d0af83a64cc86b0e492909bb",
		"title": "Here's why Adam Neumann's mysterious billion dollar real estate startup will go head-to-head with WeWork",
		"link": "https://www.businessinsider.com/why-adam-neumanns-real-estate-startup-will-compete-with-wework-2023-12",
		"keywords": [
			"Tech",
			"Real Estate",
			"Startups",
			"real-estate",
			"startups",
			"tech",
			"venture-capital"
		],
		"creator": ["bbergman@insider.com (Ben Bergman)"],
		"video_url": null,
		"description": "Adam Neumann said Flow would either \"compete or partner\" with WeWork. But from what I could tell after visiting what will be its first building, Flow doesn't need WeWork.",
		"content": "When I walked into the lobby of Society Las Olas, an Adam Neumann-owned apartment building in Fort Lauderdale, Florida, I felt like I was entering a WeWork. There were playful neon signs on the wall (\"Choose Happiness\"), colorful midcentury-modern furniture, soft lighting, and lush greenery. I had come here to try to better understand Neumann's secretive new residential real estate startup, Flow. Last month, Neumann's people agreed to let me tour Society Las Olas, which will officially be Flow's first building come early next year. They also arranged interviews with staff and residents. At a conference in July , Neumann, who cofounded WeWork in 2010, said Flow would either \"compete or partner\" with his former company. Since WeWork last month filed for bankruptcy protection, there's been speculation Neumann could buy it back. From what I could tell, Flow doesn't need WeWork. Firstly, Neumann's noncompete agreement expired at the end of October. Secondly, if you're using Flow's own coworking space, there'd be no reason to also pay hundreds of dollars a month for a WeWork subscription, especially when more people are working from home and gig employment is increasingly popular . And lastly, Flow is putting a huge emphasis on commerce and professional networking that residents I spoke to say has been helpful in growing their businesses. \"The ability to network with a lot of different people through the building has given me the opportunity to gain a lot more clients,\" said Matthew Sorrentino, a young life-insurance broker. \"I'm in a relationship industry.\" There are regular \"demo days\" for residents and guests to showcase their businesses or anything else they want to present on, like financial wellness or the history of wine. On so-called Community Commerce digital message boards in the lobby, residents can advertise services such as car detailing or mental-health counseling. Tara Carter, who's a real-estate agent, says she's generated so much business from living in the building that she's \"able to essentially almost live for free.\" Read more: Adam Neumann created a secretive billion-dollar startup to turn apartment living into a utopian fantasy. I was the first reporter to set foot inside.",
		"pubDate": "2023-12-20 00:53:33",
		"image_url": null,
		"source_id": "insider",
		"source_priority": 213,
		"country": ["united states of america"],
		"category": ["top"],
		"language": "english"
	}
]
